{
  "key": "Crab",
  "items": [
    {
      "name": "Stir-Fried Meat Crab with Pumpkin Creamy Butter Salted Egg Sauce",
      "description": "Stir-fried meat crab with pumpkin creamy butter salted egg sauce, a seasonal delicacy that combines the rich flavors of crab with the sweetness of pumpkin and the savory taste of salted egg.",
      "imageUrl": "https://trello.com/1/cards/68e68c2d4ec0f36a937c41d9/attachments/68e68c7e4805e33a79d97c72/download/page17_img3.png",
      "translations": {
        "vi": {
          "name": "Cua thịt xào sốt trứng muối kem bí đỏ",
          "description": "Cua thịt xào sốt trứng muối kem bí đỏ, một món ăn theo mùa kết hợp giữa hương vị đậm đà của cua với vị ngọt của bí đỏ và vị mặn của trứng muối.  "
        },
        "th": {
          "name": "ปูเนื้อผัดซอสครีมเนยไข่เค็มฟักทอง",
          "description": "ปูเนื้อผัดซอสครีมเนยไข่เค็มฟักทอง อาหารตามฤดูกาลที่ผสมผสานรสชาติอันเข้มข้นของปูกับความหวานของฟักทองและรสเค็มของไข่เค็ม"
        },
        "zh": {
          "name": "金瓜咸蛋奶油蟹",
          "description": "金瓜咸蛋奶油蟹是一道季节性美食，将蟹肉的丰富风味与南瓜的甜美和咸蛋的鲜咸完美结合。"
        }
      },
      "variants": [
        {
          "isSeasonal": true
        }
      ]
    },
    {
      "name": "Stir-Fried Meat Crab with Hot & Sour Sauce",
      "description": "Stir-fried meat crab with hot & sour sauce, a seasonal delicacy that combines the rich flavors of crab with the tangy and spicy notes of the sauce.",
      "imageUrl": "https://trello.com/1/cards/68e68c2d4ec0f36a937c41d9/attachments/68e68c792388002bf8b316c2/download/page17_img5.png",
      "translations": {
        "vi": {
          "name": "Cua thịt xào sốt chua cay",
          "description": "Cua thịt xào sốt chua cay, một món ăn theo mùa kết hợp giữa hương vị đậm đà của cua với vị chua và cay của sốt."
        },
        "th": {
          "name": "ปูเนื้อผัดซอสเปรี้ยวเผ็ด",
          "description": "ปูเนื้อผัดซอสเปรี้ยวเผ็ด อาหารตามฤดูกาลที่ผสมผสานรสชาติอันเข้มข้นของปูกับความเปรี้ยวและเผ็ดของซอส"
        },
        "zh": {
          "name": "酸辣蟹",
          "description": "酸辣蟹是一道季节性美食，将蟹肉的丰富风味与酸辣的酱汁完美结合。"
        }
      },
      "variants": [
        {
          "isSeasonal": true
        }
      ]
    },
    {
      "name": "Stir-Fried Meat Crab with Glass Noodle",
      "description": "Stir-fried meat crab with glass noodle, a seasonal delicacy that combines the rich flavors of crab with the light and chewy texture of glass noodles.",
      "imageUrl": "https://trello.com/1/cards/68e68c2d4ec0f36a937c41d9/attachments/68e68c7f82f950e9caea2465/download/page17_img4.png",
      "translations": {
        "vi": {
          "name": "Cua thịt xào miến",
          "description": "Cua thịt xào miến, một món ăn theo mùa kết hợp giữa hương vị đậm đà của cua với kết cấu nhẹ và dai của miến."
        },
        "th": {
          "name": "ปูเนื้อผัดวุ้นเส้น",
          "description": "ปูเนื้อผัดวุ้นเส้น อาหารตามฤดูกาลที่ผสมผสานรสชาติอันเข้มข้นของปูกับเนื้อสัมผัสที่เบาและเหนียวนุ่มของวุ้นเส้น"
        },
        "zh": {
          "name": "肉蟹冬粉煲",
          "description": "肉蟹冬粉煲是一道季节性美食，将蟹肉的丰富风味与冬粉的轻盈和韧性完美结合。"
        }
      },
      "variants": [
        {
          "isSeasonal": true
        }
      ]
    },
    {
      "name": "Stir-Fried Meat Crab with Creamy Butter Salted Egg Sauce",
      "description": "Stir-fried meat crab with creamy butter salted egg sauce, a seasonal delicacy that combines the rich flavors of crab with the creamy texture of butter and the savory taste of salted egg.",
      "imageUrl": "https://trello.com/1/cards/68e68c2d4ec0f36a937c41d9/attachments/68e68c7be3adfe6966007c01/download/page17_img1.png",
      "translations": {
        "vi": {
          "name": "Cua thịt xào sốt trứng muối kem bơ",
          "description": "Cua thịt xào sốt trứng muối kem bơ, một món ăn theo mùa kết hợp giữa hương vị đậm đà của cua với vị béo ngậy của kem bơ và vị mặn của trứng muối."
        },
        "th": {
          "name": "ปูเนื้อผัดซอสครีมเนยไข่เค็ม",
          "description": "ปูเนื้อผัดซอสครีมเนยไข่เค็ม อาหารตามฤดูกาลที่ผสมผสานรสชาติอันเข้มข้นของปูกับความมันของครีมเนยและรสเค็มของไข่เค็ม"
        },
        "zh": {
          "name": "咸蛋奶油蟹",
          "description": "咸蛋奶油蟹是一道季节性美食，将蟹肉的丰富风味与奶油的细腻和咸蛋的鲜咸完美结合。"
        }
      },
      "variants": [
        {
          "isSeasonal": true
        }
      ]
    },
    {
      "name": "Stir-Fried Meat Crab with Rice Noodle",
      "description": "Stir-fried meat crab with rice noodle, a seasonal delicacy that combines the rich flavors of crab with the soft and silky texture of rice noodles.",
      "imageUrl": "https://trello.com/1/cards/68e68c2d4ec0f36a937c41d9/attachments/68e68c7d3bacd15ce5e24750/download/page17_img2.png",
      "translations": {
        "vi": {
          "name": "Cua thịt xào bún gạo",
          "description": "Cua thịt xào bún gạo, một món ăn theo mùa kết hợp giữa hương vị đậm đà của cua với kết cấu mềm mại và mượt mà của bún gạo."
        },
        "th": {
          "name": "ปูเนื้อผัดเส้นหมี่",
          "description": "ปูเนื้อผัดเส้นหมี่ อาหารตามฤดูกาลที่ผสมผสานรสชาติอันเข้มข้นของปูกับเนื้อสัมผัสที่นุ่มและลื่นของเส้นหมี่"
        },
        "zh": {
          "name": "肉蟹炒米粉",
          "description": "肉蟹炒米粉是一道季节性美食，将蟹肉的丰富风味与米粉的柔软和丝滑完美结合。"
        }
      },
      "variants": [
        {
          "isSeasonal": true
        }
      ]
    }
  ]
}