{
  "key": "Bean Curd",
  "items": [
    {
      "name": "Bean Curd with Mince Meat \u0026 Mushrooms",
      "description": "A traditional home-style dish, featuring silky bean curd stir-fried with savory minced meat and assorted mushrooms, creating a perfect balance of flavors and textures.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/bean-curd-with-mince-meat-and-mushrooms-1767402063.png",
      "variants": [
        {
          "label": "S",
          "price": 20,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 30,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้ผัดหมูสับและเห็ด",
          "description": "จานอาหารแบบโฮมสไตล์ที่มีเต้าหู้นุ่มนวลผัดกับหมูสับและเห็ดหลากหลายชนิด สร้างความสมดุลที่ลงตัวระหว่างรสชาติและเนื้อสัมผัส"
        },
        "vi": {
          "name": "Đậu hũ với thịt băm và nấm",
          "description": "Món ăn truyền thống tại gia, gồm đậu hũ mềm mịn xào cùng thịt băm đậm đà và các loại nấm đa dạng, tạo nên sự cân bằng hoàn hảo giữa hương vị và kết cấu."
        },
        "zh": {
          "name": "家乡豆腐",
          "description": "一道传统的家常菜，采用丝滑的豆腐与美味的肉末和各种蘑菇翻炒而成，完美平衡了风味和口感。"
        }
      }
    },
    {
      "name": "Braised Garoupa Belly with Bean Curd",
      "description": "A luxurious dish featuring tender garoupa belly braised to perfection with silky bean curd, creating a harmonious blend of rich flavors and smooth textures.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-garoupa-belly-with-bean-curd-1767402065.png",
      "variants": [
        {
          "label": "S",
          "price": 45,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 90,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "ปลากะรังตุ๋นกับเต้าหู้",
          "description": "จานหรูหราที่มีท้องปลากะรังนุ่มนวลตุ๋นจนได้ที่กับเต้าหู้เนียนนุ่ม สร้างความกลมกลืนระหว่างรสชาติที่เข้มข้นและเนื้อสัมผัสที่นุ่มละมุน"
        },
        "vi": {
          "name": "Bụng cá mú hầm với đậu hũ",
          "description": "Món ăn sang trọng với bụng cá mú mềm mại được hầm hoàn hảo cùng với đậu hũ mịn màng, tạo nên sự hòa quyện giữa hương vị đậm đà và kết cấu mượt mà."
        },
        "zh": {
          "name": "豆卜焖斑腩",
          "description": "一道奢华的菜肴，采用嫩滑的斑腩与豆腐炖煮而成，创造出丰富的风味和顺滑的口感。"
        }
      }
    },
    {
      "name": "Bean Curd 'Ma-Poh' Style",
      "description": "A spicy and flavorful dish featuring silky bean curd cooked with minced meat, chili bean paste, and a medley of spices, creating a bold and aromatic experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/bean-curd-'ma-poh'-style-1767402066.png",
      "variants": [
        {
          "label": "S",
          "price": 20,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 30,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้มาโพ",
          "description": "จานที่เผ็ดร้อนและเต็มไปด้วยรสชาติที่มีเต้าหู้นุ่มนวลปรุงรสด้วยหมูสับ, เต้าหู้พริก และเครื่องเทศหลากหลายชนิด สร้างประสบการณ์ที่กล้าหาญและมีกลิ่นหอม"
        },
        "vi": {
          "name": "Đậu hũ kiểu Ma Bà",
          "description": "Một món ăn cay và đầy hương vị với đậu hũ mịn màng được nấu cùng thịt băm, tương ớt và nhiều loại gia vị, tạo nên một trải nghiệm đậm đà và thơm ngon."
        },
        "zh": {
          "name": "麻婆豆腐",
          "description": "一道辛辣美味的菜肴，采用丝滑豆腐与肉末、豆瓣酱和多种香料烹饪而成，创造出大胆而芳香的体验。"
        }
      }
    },
    {
      "name": "Bean Curd with Mince Meat",
      "description": "A simple yet delicious dish featuring silky bean curd stir-fried with savory minced meat, creating a comforting and flavorful meal.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/bean-curd-with-mince-meat-1767402068.png",
      "variants": [
        {
          "label": "S",
          "price": 20,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 30,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้ผัดหมูสับ",
          "description": "จานที่เรียบง่ายแต่แสนอร่อยที่มีเต้าหู้นุ่มนวลผัดกับหมูสับรสชาติเข้มข้น สร้างมื้ออาหารที่ให้ความรู้สึกอบอุ่นและเต็มไปด้วยรสชาติ"
        },
        "vi": {
          "name": "Đậu hũ với thịt băm",
          "description": "Món ăn đơn giản nhưng ngon miệng với đậu hũ mịn màng xào cùng thịt băm đậm đà, tạo nên một bữa ăn đầy ắp hương vị và sự thoải mái."
        },
        "zh": {
          "name": "豆瓣酱肉碎豆腐",
          "description": "一道简单却美味的菜肴，采用丝滑豆腐与美味的肉末翻炒而成，创造出令人舒适且充满风味的餐点。"
        }
      }
    },
    {
      "name": "Bean Curd with Light Soy Sauce",
      "description": "A classic dish featuring silky bean curd drizzled with light soy sauce, garnished with fresh scallions and a hint of sesame oil, creating a simple yet flavorful experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/bean-curd-with-light-soy-sauce-1767402069.png",
      "variants": [
        {
          "label": "S",
          "price": 16,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 24,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้ราดซอสซีอิ๊ว",
          "description": "จานคลาสสิกที่มีเต้าหู้นุ่มนวลราดด้วยซอสซีอิ๊วใส่ต้นหอมสดและน้ำมันงาเล็กน้อย สร้างประสบการณ์ที่เรียบง่ายแต่เต็มไปด้วยรสชาติ"
        },
        "vi": {
          "name": "Đậu hũ với nước tương nhạt",
          "description": "Một món ăn cổ điển với đậu hũ mịn màng được rưới nước tương nhạt, trang trí với hành lá tươi và một chút dầu mè, tạo nên một trải nghiệm đơn giản nhưng đầy hương vị."
        },
        "zh": {
          "name": "原汁酱油豆腐",
          "description": "一道经典的菜肴，采用丝滑豆腐淋上清淡酱油，点缀新鲜葱花和少许香油，创造出简单却美味的体验。"
        }
      }
    },
    {
      "name": "Bean Curd with Bean Curd Skin",
      "description": "A delightful dish featuring silky bean curd paired with crispy bean curd skin, stir-fried together to create a perfect balance of textures and flavors.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/bean-curd-with-bean-curd-skin-1767402070.png",
      "variants": [
        {
          "label": "S",
          "price": 26,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 40,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้กับฟองเต้าหู้",
          "description": "จานที่น่ารับประทานที่มีเต้าหู้นุ่มนวลคู่กับฟองเต้าหู้กรอบ ผัดรวมกันเพื่อสร้างความสมดุลที่ลงตัวระหว่างเนื้อสัมผัสและรสชาติ"
        },
        "vi": {
          "name": "Đậu hũ với váng đậu",
          "description": "Một món ăn thú vị với đậu hũ mịn màng kết hợp với váng đậu giòn, được xào chung để tạo ra sự cân bằng hoàn hảo giữa các kết cấu và hương vị."
        },
        "zh": {
          "name": "豆根自制豆腐",
          "description": "一道美味的菜肴，采用丝滑豆腐搭配脆皮豆腐皮，翻炒在一起，创造出完美的口感和风味平衡。"
        }
      }
    },
    {
      "name": "Fried Bean Curd with Pandan Leaf \u0026 Salted Egg",
      "description": "A unique dish featuring crispy fried bean curd infused with the aromatic flavor of pandan leaf and the rich taste of salted egg, creating a delightful combination of textures and flavors.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/fried-bean-curd-with-pandan-leaf-and-salted-egg-1767402072.png",
      "variants": [
        {
          "label": "S",
          "price": 26,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 40,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้ทอดใบเตยไข่เค็ม",
          "description": "จานที่มีเต้าหู้นุ่มนวลทอดกรอบซึ่งมีกลิ่นหอมของใบเตยและรสชาติของไข่เค็ม สร้างความลงตัวระหว่างเนื้อสัมผัสและรสชาติ"
        },
        "vi": {
          "name": "Đậu hũ chiên với lá dứa và trứng muối",
          "description": "Một món ăn độc đáo với đậu hũ chiên giòn thấm đẫm hương thơm của lá dứa và vị béo ngậy của trứng muối, tạo nên sự kết hợp thú vị giữa các kết cấu và hương vị."
        },
        "zh": {
          "name": "班兰叶炒咸蛋豆腐",
          "description": "一道独特的菜肴，采用香脆的炸豆腐，融入香兰叶的芳香和咸蛋的浓郁味道，创造出令人愉悦的口感和风味组合。"
        }
      }
    },
    {
      "name": "'Thai Style' Homemade Bean Curd",
      "description": "A flavorful dish featuring homemade bean curd cooked in a Thai-inspired sauce, combining savory, sweet, and tangy flavors for a delightful culinary experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/'thai-style'-homemade-bean-curd-1767402073.png",
      "variants": [
        {
          "label": "S",
          "price": 22,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 34,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดสไตล์ไทย",
          "description": "จานที่มีเต้าหู้นุ่มนวลทำเองปรุงในซอสที่ได้แรงบันดาลใจจากไทย ผสมผสานรสชาติที่เค็ม หวาน และเปรี้ยวเข้าด้วยกันเพื่อสร้างประสบการณ์การทำอาหารที่น่าพอใจ"
        },
        "vi": {
          "name": "Đậu hũ tự làm kiểu Thái",
          "description": "Một món ăn đầy hương vị với đậu hũ tự làm được nấu trong nước sốt lấy cảm hứng từ Thái Lan, kết hợp giữa vị mặn, ngọt và chua cho một trải nghiệm ẩm thực thú vị."
        },
        "zh": {
          "name": "香芒自制豆腐",
          "description": "一道美味的菜肴，采用自制豆腐，烹饪在泰式风味的酱汁中，结合咸、甜、酸的味道，带来愉悦的烹饪体验。"
        }
      }
    },
    {
      "name": "Braised Homemade Bean Curd with Seafood",
      "description": "A delectable dish featuring homemade bean curd braised with fresh seafood, creating a perfect harmony of flavors between the sweetness of the seafood and the silky texture of the bean curd.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-homemade-bean-curd-with-seafood-1767402074.png",
      "variants": [
        {
          "label": "S",
          "price": 32,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 48,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดตุ๋นกับอาหารทะเล",
          "description": "จานที่มีเต้าหู้นุ่มนวลทำเองตุ๋นกับอาหารทะเลสดใหม่ สร้างความลงตัวระหว่างรสชาติหวานของอาหารทะเลและความนุ่มของเต้าหู้"
        },
        "vi": {
          "name": "Đậu hũ tự làm hầm với hải sản",
          "description": "Một món ăn ngon miệng với đậu hũ tự làm được hầm cùng hải sản tươi ngon, tạo nên sự kết hợp hoàn hảo giữa vị ngọt của hải sản và độ mềm mịn của đậu hũ."
        },
        "zh": {
          "name": "海鲜自制豆腐",
          "description": "一道美味的菜肴，采用自制豆腐与新鲜海鲜一同炖煮，完美结合了海鲜的鲜甜与豆腐的细腻。"
        }
      }
    },
    {
      "name": "Braised Homemade Bean Curd with Mixed Vegetables \u0026 Mushrooms",
      "description": "A wholesome dish featuring homemade bean curd braised with a colorful medley of fresh vegetables and assorted mushrooms, creating a nutritious and flavorful meal.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-homemade-bean-curd-with-mixed-vegetables-and-mushrooms-1767402076.png",
      "variants": [
        {
          "label": "S",
          "price": 26,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 40,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดตุ๋นผักและเห็ดรวม",
          "description": "จานที่มีเต้าหู้นุ่มนวลทำเองตุ๋นกับผักสดและเห็ดหลากหลายชนิด สร้างมื้ออาหารที่มีคุณค่าทางโภชนาการและรสชาติที่หลากหลาย"
        },
        "vi": {
          "name": "Đậu hũ tự làm hầm với rau củ và nấm",
          "description": "Một món ăn bổ dưỡng với đậu hũ tự làm được hầm cùng với nhiều loại rau củ tươi ngon và nấm, tạo nên một bữa ăn đầy đủ dinh dưỡng và hương vị."
        },
        "zh": {
          "name": "杂锦鲜菇扒自制豆腐",
          "description": "一道健康的菜肴，采用自制豆腐与新鲜蔬菜和各种蘑菇一同炖煮，创造出营养丰富且美味的餐点。"
        }
      }
    },
    {
      "name": "Homemade Bean Curd with Crab Meat \u0026 Shark Fin",
      "description": "A luxurious dish featuring homemade bean curd, fresh crab meat, and shark fin, creating a perfect combination of flavors and silky textures.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/homemade-bean-curd-with-crab-meat-and-shark-fin-1767402077.png",
      "variants": [
        {
          "label": "S",
          "price": 32,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 48,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดกับเนื้อปูและครีบฉลาม",
          "description": "จานที่มีเต้าหู้นุ่มนวลทำเองเสิร์ฟพร้อมเนื้อปูสดและครีบฉลาม สร้างความลงตัวระหว่างรสชาติและเนื้อสัมผัส"
        },
        "vi": {
          "name": "Đậu hũ tự làm với thịt cua và vi cá",
          "description": "Một món ăn sang trọng với đậu hũ tự làm, thịt cua tươi ngon và vi cá, tạo nên sự kết hợp hoàn hảo giữa hương vị và độ mềm mịn."
        },
        "zh": {
          "name": "蟹肉鱼翅扒自制豆腐",
          "description": "一道奢华的菜肴，采用自制豆腐、鲜美的蟹肉和鱼翅，完美结合了风味与细腻的口感。"
        }
      }
    },
    {
      "name": "Homemade Bean Curd with Dried Scallops \u0026 Crab Stick",
      "description": "A delightful dish featuring homemade bean curd paired with dried scallops and crab sticks, creating a unique combination of flavors and textures.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/homemade-bean-curd-with-dried-scallops-and-crab-stick-1767402079.png",
      "variants": [
        {
          "label": "S",
          "price": 32,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 48,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดกับหอยเชลล์แห้งและปูอัด",
          "description": "จานที่มีเต้าหู้นุ่มนวลทำเองเสิร์ฟพร้อมหอยเชลล์แห้งและปูอัด สร้างความลงตัวระหว่างรสชาติและเนื้อสัมผัส"
        },
        "vi": {
          "name": "Đậu hũ tự làm với sò điệp khô và thanh cua",
          "description": "Một món ăn ngon miệng với đậu hũ tự làm kết hợp với sò điệp khô và thanh cua, tạo nên sự kết hợp độc đáo giữa các hương vị và kết cấu."
        },
        "zh": {
          "name": "千贝蟹柳扒自制豆腐",
          "description": "一道美味的菜肴，采用自制豆腐搭配干贝和蟹柳，创造出独特的风味和口感。"
        }
      }
    },
    {
      "name": "Homemade Bean Curd with 'Seng Gua'",
      "description": "'Seng Gua', also known as 'Luffa' or 'Chinese Okra', is a type of gourd that is commonly used in Asian cuisine. This dish features homemade bean curd stir-fried with tender slices of 'Seng Gua', creating a light and refreshing meal that is both nutritious and delicious.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/homemade-bean-curd-with-'seng-gua'-1767402080.png",
      "variants": [
        {
          "label": "S",
          "price": 20,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 30,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดผัดมะระ",
          "description": "'Seng Gua' หรือที่รู้จักกันในชื่อ 'มะระ' เป็นประเภทของฟักที่มักใช้ในอาหารเอเชีย จานนี้มีเต้าหู้นุ่มนวลทำเองผัดกับมะระหั่นบาง สร้างมื้ออาหารที่เบาและสดชื่นซึ่งมีคุณค่าทางโภชนาการและอร่อย"
        },
        "vi": {
          "name": "Đậu hũ tự làm với mướp hương",
          "description": "'Seng Gua', còn được gọi là 'Mướp Hương' hoặc 'Mướp Trung Quốc', là một loại bí thường được sử dụng trong ẩm thực châu Á. Món ăn này có đậu hũ tự làm xào với những lát mướp hương mềm mại, tạo nên một bữa ăn nhẹ nhàng và tươi mát, vừa bổ dưỡng vừa ngon miệng."
        },
        "zh": {
          "name": "胜瓜自制豆腐",
          "description": "'胜瓜'，也称为'丝瓜'或'中国丝瓜'，是一种常用于亚洲菜肴的葫芦。这道菜以自制豆腐与嫩滑的'胜瓜'片一同翻炒，创造出一道清淡可口、营养丰富的美味佳肴。"
        }
      }
    },
    {
      "name": "Homemade Bean Curd with Preserved Vegetable",
      "description": "This dish features homemade bean curd stir-fried with preserved vegetables, creating a perfect balance between the creamy texture of the bean curd and the tangy, salty flavor of the preserved vegetables.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/homemade-bean-curd-with-preserved-vegetable-1767402081.png",
      "variants": [
        {
          "label": "S",
          "price": 24,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 36,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดกับผักดอง",
          "description": "จานนี้มีเต้าหู้นุ่มนวลทำเองเสิร์ฟพร้อมผักดอง สร้างความลงตัวระหว่างรสชาติและเนื้อสัมผัส"
        },
        "vi": {
          "name": "Đậu hũ tự làm với dưa muối",
          "description": "Món ăn này có đậu hũ tự làm kết hợp với dưa muối, tạo nên sự hòa quyện giữa vị béo ngậy của đậu hũ và vị chua mặn của dưa."
        },
        "zh": {
          "name": "菜香自制豆腐",
          "description": "这道菜以自制豆腐与腌制蔬菜一同翻炒，创造出一道美味可口的佳肴。"
        }
      }
    },
    {
      "name": "Homemade Bean Curd with Minced Pork",
      "description": "This dish features homemade bean curd stir-fried with minced pork, creating a perfect balance between the creamy texture of the bean curd and the savory flavor of the pork.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/homemade-bean-curd-with-minced-pork-1767402083.png",
      "variants": [
        {
          "label": "S",
          "price": 24,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 36,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เต้าหู้โฮมเมดกับหมูสับ",
          "description": "จานนี้มีเต้าหู้นุ่มนวลทำเองเสิร์ฟพร้อมหมูสับ สร้างความลงตัวระหว่างรสชาติและเนื้อสัมผัส"
        },
        "vi": {
          "name": "Đậu hũ tự làm với thịt heo băm",
          "description": "Món ăn này có đậu hũ tự làm kết hợp với thịt heo băm, tạo nên sự hòa quyện giữa vị béo ngậy của đậu hũ và vị đậm đà của thịt."
        },
        "zh": {
          "name": "肉碎自制豆腐",
          "description": "这道菜以自制豆腐与肉碎一同翻炒，创造出一道美味可口的佳肴。"
        }
      }
    }
  ]
}
