{
  "key": "Shark Fin \u0026 Abalone",
  "items": [
    {
      "name": "Buddha Jumps Over the Wall",
      "description": "A Chinese delicacy that consists of various high-quality ingredients such as shark fin, abalone, sea cucumber, dried scallops, and ginseng, all simmered together in a rich broth. The dish is known for its complex flavors and luxurious ingredients.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/buddha-jumps-over-the-wall-1767402232.png",
      "variants": [
        {
          "label": "",
          "price": 88,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "พระกระโดดกำแพง",
          "description": "อาหารจีนที่ประกอบด้วยส่วนผสมคุณภาพสูงต่างๆ เช่น ครีบฉลาม เป๋าฮื้อ ปลิงทะเล หอยเชลล์แห้ง และโสม ทั้งหมดนี้เคี่ยวรวมกันในน้ำซุปเข้มข้น จานนี้เป็นที่รู้จักในด้านรสชาติที่ซับซ้อนและส่วนผสมที่หรูหรา"
        },
        "vi": {
          "name": "Phật Nhảy Tường",
          "description": "Một món ăn Trung Quốc bao gồm nhiều nguyên liệu cao cấp như vi cá mập, bào ngư, hải sâm, sò điệp khô và nhân sâm, tất cả được ninh nhừ trong nước dùng đậm đà. Món ăn nổi tiếng với hương vị phức tạp và nguyên liệu sang trọng."
        },
        "zh": {
          "name": "盅仔佛跳墙",
          "description": "这是一道中国美食，由多种高品质食材组成，如鱼翅、鲍鱼、海参、干贝和人参，所有这些都在浓郁的汤中炖煮在一起。这道菜以其复杂的风味和奢华的食材而闻名。"
        }
      }
    },
    {
      "name": "Braised Shark Fin with Crab Meat",
      "description": "A luxurious dish featuring tender shark fin braised to perfection and served with succulent crab meat. The combination of the delicate texture of the shark fin and the rich flavor of the crab meat creates a harmonious and indulgent culinary experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-shark-fin-with-crab-meat-1767402233.png",
      "variants": [
        {
          "label": "1 pax",
          "price": 32,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "5 pax",
          "price": 108,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "10 pax",
          "price": 198,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "ครีบฉลามตุ๋นเนื้อปู",
          "description": "จานหรูหราที่มีครีบฉลามนุ่มนวลตุ๋นจนได้ที่และเสิร์ฟพร้อมกับเนื้อปูฉ่ำ รสชาติที่ละเอียดอ่อนของครีบฉลามและรสชาติที่เข้มข้นของเนื้อปูสร้างประสบการณ์การทำอาหารที่กลมกลืนและหรูหรา"
        },
        "vi": {
          "name": "Vi cá mập hầm thịt cua",
          "description": "Món ăn sang trọng với vi cá mập mềm mại được hầm hoàn hảo và phục vụ cùng thịt cua ngọt ngào. Sự kết hợp giữa kết cấu tinh tế của vi cá mập và hương vị đậm đà của thịt cua tạo nên một trải nghiệm ẩm thực hài hòa và xa xỉ."
        },
        "zh": {
          "name": "蟹皇翅",
          "description": "这是一道奢华的菜肴，采用嫩滑的鱼翅炖煮至完美，并配以鲜美的蟹肉。鱼翅的细腻口感与蟹肉的丰富风味相结合，创造出和谐而奢华的烹饪体验。"
        }
      }
    },
    {
      "name": "Braised Shark Fin with Superior Broth",
      "description": "A classic Chinese delicacy featuring tender shark fin braised in a rich and flavorful superior broth. The dish is known for its luxurious ingredients and exquisite taste, making it a popular choice for special occasions and celebrations.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-shark-fin-with-superior-broth-1767402234.png",
      "variants": [
        {
          "label": "",
          "price": 68,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "ครีบฉลามตุ๋นน้ำซุปชั้นดี",
          "description": "A classic Chinese delicacy featuring tender shark fin braised in a rich and flavorful superior broth. The dish is known for its luxurious ingredients and exquisite taste, making it a popular choice for special occasions and celebrations."
        },
        "vi": {
          "name": "Vi cá mập hầm với nước dùng thượng hạng",
          "description": "Món ăn Trung Quốc cổ điển với vi cá mập mềm mại được hầm trong nước dùng thượng hạng đậm đà và đầy hương vị. Món ăn nổi tiếng với nguyên liệu sang trọng và hương vị tinh tế, khiến nó trở thành lựa chọn phổ biến cho các dịp đặc biệt và lễ kỷ niệm."
        },
        "zh": {
          "name": "上汤炖鲍翅",
          "description": "这是一道经典的中国美食，采用嫩滑的鱼翅炖煮在浓郁美味的上汤中。这道菜以其奢华的食材和精致的口味而闻名，是特殊场合和庆祝活动的热门选择。"
        }
      }
    },
    {
      "name": "Braised Baby Abalone with Mushrooms \u0026 Broccoli",
      "description": "A delightful dish featuring tender baby abalone braised with fragrant mushrooms and fresh broccoli. The combination of the oceanic flavors of the abalone, the earthy notes of the mushrooms, and the vibrant crunch of the broccoli creates a well-balanced and nutritious meal.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-baby-abalone-with-mushrooms-and-broccoli-1767402236.png",
      "variants": [
        {
          "label": "S",
          "price": 118,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 188,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "เป๋าฮือตุ๋นเห็ดหอมและบร็อคโคลี",
          "description": "จานอร่อยที่มีเป๋าฮือตุ๋นจนได้ที่พร้อมกับเห็ดหอมและบร็อคโคลีสด ความกลมกลืนระหว่างรสชาติของเป๋าฮือตามท้องทะเล รสชาติของเห็ดที่มีกลิ่นหอม และความกรอบสดของบร็อคโคลีสร้างสรรค์มื้ออาหารที่สมดุลและมีคุณค่าทางโภชนาการ"
        },
        "vi": {
          "name": "Bào ngư hầm nấm đông cô và bông cải xanh",
          "description": "Món ăn ngon với bào ngư non mềm mại được hầm cùng nấm thơm và bông cải xanh tươi. Sự kết hợp giữa hương vị biển của bào ngư, hương vị đất của nấm và độ giòn tươi của bông cải xanh tạo nên một bữa ăn cân bằng và bổ dưỡng."
        },
        "zh": {
          "name": "鲍鱼冬菇西兰花",
          "description": "这是一道美味的菜肴，采用嫩滑的鲍鱼与香菇和新鲜的西兰花炖煮而成。鲍鱼的海洋风味、蘑菇的泥土气息和西兰花的鲜脆口感相结合，创造出均衡且营养丰富的餐点。"
        }
      }
    },
    {
      "name": "Braised Sea Cucumber, Fish Maw \u0026 Mushrooms",
      "description": "A luxurious dish featuring tender sea cucumber and fish maw braised with fragrant mushrooms in a rich and flavorful sauce. The combination of the unique textures of the sea cucumber and fish maw, along with the earthy flavors of the mushrooms, creates a delightful and indulgent culinary experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/braised-sea-cucumber,-fish-maw-and-mushrooms-1767402237.png",
      "variants": [
        {
          "label": "S",
          "price": 118,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 188,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "ปลิงทะเล กระเพาะปลา และเห็ดหอมตุ๋น",
          "description": "จานหรูหราที่มีปลิงทะเลและกระเพาะปลานุ่มๆ ตุ๋นกับเห็ดหอมในซอสที่เข้มข้นและเต็มไปด้วยรสชาติ การรวมกันของเนื้อสัมผัสที่เป็นเอกลักษณ์ของปลิงทะเลและกระเพาะปลา พร้อมกับรสชาติที่เป็นดินของเห็ด สร้างประสบการณ์การทำอาหารที่น่าพอใจและหรูหรา"
        },
        "vi": {
          "name": "Hải sâm, bong bóng cá và nấm đông cô hầm",
          "description": "Món ăn sang trọng với hải sâm và bong bóng cá mềm mại được hầm cùng nấm thơm trong nước sốt đậm đà và đầy hương vị. Sự kết hợp giữa kết cấu độc đáo của hải sâm và bong bóng cá, cùng với hương vị đất của nấm, tạo nên một trải nghiệm ẩm thực thú vị và xa xỉ."
        },
        "zh": {
          "name": "冬菇鱼鳔海参",
          "description": "这是一道奢华的菜肴，采用嫩滑的海参和鱼肚与香菇炖煮而成，浸泡在浓郁美味的酱汁中。海参和鱼肚独特的口感与蘑菇的泥土气息相结合，创造出令人愉悦的奢华美食体验。"
        }
      }
    },
    {
      "name": "Stir-Fried Egg with Shark Fin \u0026 Crab Meat",
      "description": "A delectable dish featuring fluffy scrambled eggs stir-fried with tender shark fin and succulent crab meat. The combination of the creamy texture of the eggs, the delicate flavor of the shark fin, and the rich taste of the crab meat creates a harmonious and indulgent culinary experience.",
      "imageUrl": "https://assets.yaoyaodinner.party/menu/stir-fried-egg-with-shark-fin-and-crab-meat-1767402239.png",
      "variants": [
        {
          "label": "S",
          "price": 40,
          "currency": "RM",
          "isSeasonal": false
        },
        {
          "label": "L",
          "price": 78,
          "currency": "RM",
          "isSeasonal": false
        }
      ],
      "translations": {
        "th": {
          "name": "ไข่ผัดครีบฉลามและเนื้อปู",
          "description": "จานอร่อยที่มีไข่ผัดครีบฉลามและเนื้อปู"
        },
        "vi": {
          "name": "Trứng chiên xào vi cá mập và thịt cua",
          "description": "Món ăn ngon với trứng xào bông cải xanh và thịt cua tươi ngon."
        },
        "zh": {
          "name": "桂花翅",
          "description": "这是一道美味的菜肴，采用嫩滑的鲍鱼与香菇和新鲜的西兰花炖煮而成。鲍鱼的海洋风味、蘑菇的泥土气息和西兰花的鲜脆口感相结合，创造出均衡且营养丰富的餐点。"
        }
      }
    }
  ]
}
